{
  "basics": {
    "name": "Loïc Colin",
    "label": "Senior Front-end Developer",
    "image": "",
    "email": "loic-col@hotmail.fr",
    "url": "",
    "summary": "A summary of John Doe…",
    "location": {
      "city": "Berlin",
      "countryCode": "DE",
      "region": "Germany"
    },
    "profiles": [
      {
        "network": "GitHub",
        "username": "LoicCol",
        "url": "https://github.com/LoicCol"
      }
    ]
  },
  "work": [
    {
      "name": "Zenjob",
      "position": "Senior Front-End Engineer",
      "url": "https://www.zenjob.com/en/",
      "startDate": "2021-11-01",
      "summary": " Zenjob, based in Berlin, Germany, matches over 20,000 talents with 12,000 part-time jobs from over 1,000 companies every month. The platform empowers the workforce of tomorrow, enabling part-time jobbers to decide when, where, and how to work with just a few clicks.",
      "highlights": [
        "I played a pivotal role at Zenjob by leading the development of a customer-facing B2B platform for effi cientorder management. This involved extensive work on front-end development using React, Typescript andother technologies.",
        "I actively participated in the development of the design system, contributing to a consistent and effi cientuser interface. Additionally, I was responsible for maintaining the mono-repository, ensuring smooth andcoordinated development efforts.",
        "I made a significant impact by integrating end-to-end tests using Playwright, which greatly improved thereliability and stability of our front-end features. This automation effort was a key part of our front-enddevelopment process.",
        "I was actively involved in monitoring system alerts to preemptively address potential incidents. Thisincluded resolving issues and conducting necessary post-mortems, using tools like Sentry, Grafana, andOpsGenie.",
        "I consistently demonstrated an eagerness to learn and grow. I developed a habit of writing clear andtestable code, gained experience with Node.js and SSR frameworks such as Next.js, and cultivated a passionfor accessible web applications."
      ]
    },
    {
      "name": "eLamp",
      "position": "Front-End Engineer",
      "url": "https://www.elamp.fr/en/",
      "startDate": "2016-09-01",
      "endDate": "2021-09-01",
      "summary": "Involved in eLamp’s early stages as a student, we started from the founders’ couch. Despite challenges, we built a successful product, leading to eLamp’s acquisition by a larger group in 2023.",
      "highlights": [
        "As the pioneering employee at eLamp, a startup, I had the unique opportunity to shape the company’s technological direction from its inception. Specializing in front-end development, I collaborated closely with the CTO to build a robust tech stack from scratch, mastering technologies such as TypeScript, React, and GraphQL.",
        "Over five years, I developed complex user interfaces, including intricate graphs and other data visualization tools. An example of this is the development of a feature that significantly enhanced data interaction and understanding for our customers. In addition, I developed several features that made our product very user-friendly and enjoyable to use. I cultivated an appreciation for aesthetically pleasing designs and took great pleasure in crafting animations that were both functional and visually engaging.",
        "I ensured the quality and reliability of our software through rigorous testing methodologies. This included unit testing, integration testing, and end-to-end testing using technologies like Cypress and React Testing Library. My commitment to quality assurance helped maintain high standards for our products and instilled confidence in our customers."
      ]
    }
  ],
  "certificates": [
    {
      "name": "Testing Javascript with Kent C.Dodds",
      "date": "2019-03-01",
      "issuer": "Kent C.Dodds",
      "url": "https://www.testingjavascript.com/"
    }
  ],
  "education": [
    {
      "institution": "Catholic University of Lille",
      "url": "https://www.univ-catholille.fr/en",
      "area": "Computer Science Engineering and Innovation.",
      "studyType": "Master",
      "startDate": "2014-09-01",
      "endDate": "2016-07-01",
      "score": "2.1",
      "courses": [
        "Gained in-depth understanding of computer science principles and software design.",
        "Learned to apply creative problem-solving in technological contexts.",
        "Acquired skills in project management, including agile and scrum methodologies.",
        "Applied theoretical knowledge to practical projects using specific programming languages or technologies.",
        "Collaborated with diverse teams on different projects."
      ]
    },
    {
      "institution": "IUT of Lens",
      "url": "http://www.iut-lens.univ-artois.fr/",
      "area": "Computer Science.",
      "studyType": "Bachelor",
      "startDate": "2011-09-01",
      "endDate": "2014-07-01",
      "score": "2.1",
      "courses": [
        "Basics of computer science and software engineering.",
        "Statistics and probability.",
        "Mathematics."
      ]
    }
  ],
  "skills": [
    {
      "name": "Front-end Development",
      "level": "Master",
      "keywords": [
        "HTML",
        "CSS",
        "JavaScript",
        "TypeScript",
        "React",
        "Vite",
        "Remix",
        "GraphQL",
        "Tailwind CSS"
      ]
    },
    {
      "name": "Front-end Testing",
      "level": "Master",
      "keywords": [
        "React Testing Library",
        "Cypress",
        "Playwright",
        "Nock",
        "Vitest"
      ]
    },
    {
      "name": "Back-end Development",
      "level": "Intermediate",
      "keywords": ["Node.js", "Express", "GraphQL", "Java", "Spring", "Kafka"]
    },
    {
      "name": "DevOps",
      "level": "Intermediate",
      "keywords": [
        "Docker",
        "Kubernetes",
        "AWS",
        "Terraform",
        "Jenkins",
        "GitHub Pages",
        "GitHub Actions"
      ]
    }
  ],
  "languages": [
    {
      "language": "French",
      "fluency": "Native speaker"
    },
    {
      "language": "English",
      "fluency": "Fluent"
    }
  ],
  "interests": [
    { "name": "Running & sports" },
    { "name": "Meditation" },
    { "name": "Electronic music - Production & Djing" }
  ]
}
